In [ ]:
import os

current_directory = os.getcwd()
print(current_directory)

C:\Users\VISLAB-seongwon\workspace

In [ ]:
import pandas as pd
all_df = pd.DataFrame(columns=['task', '상봉', '석환', '성범', '유진','재훈', '정수', '윤찬영', '정찬영', 'total'])

In [ ]:
del[all_df]

In [ ]:
all_df

Empty DataFrame
Columns: [task, 상봉, 석환, 성범, 유진, 재훈, 정수, 윤찬영, 정찬영, total]
Index: []

In [ ]:
root_dir = '실험데이터'
TASK = ['1back', '3back', '10', '20']
ANS = 'ans'
BASE = 'base'

In [ ]:
for task in TASK:
    task_row = []
    task_row.append(task)
    for subdir, dirs, files in os.walk(root_dir):
        if ANS in subdir:
            pass
        else:
            continue
        if BASE in subdir:
            pass
        else:
            continue
        
        for file in files:
            
            if file.endswith(task + '.csv'):
                
                df = pd.read_csv(subdir+'\\'+file, header=None)
                is_numeric = pd.to_numeric(df.iloc[0], errors='coerce').notnull()
                df = df.loc[:, is_numeric]
                df = pd.read_csv(subdir+'\\'+file)
            
                rows_w = df[(df.iloc[:, 2] == -1)]
                count_w = len(rows_w)
            
                rows_t = df[(df.iloc[:, 2] == 1) | (df.iloc[:, 2] == -1)]
                count_t = len(rows_t)
                
                
                print(subdir +'\\'+ file)
                print(count_w, count_t)
                
                task_row.append(count_w)
                print(task_row)
            
                del [[df,rows_w,rows_t]]
        
    task_row.append(count_t)
    all_df.loc[len(all_df)] = task_row

In [ ]:
all_df = all_df.set_index(keys='task')

In [ ]:
all_df

       상봉  석환  성범  유진  재훈  정수  윤찬영  정찬영  total
task
1back   2   0   1   1   1   2    0    1    200
3back  16  15  19  21   7   7   21   14    198
10      0   0   0   0   0   0    0    0    200
20      0   0   2   1   0   0    0    0    199

In [ ]:
row_mean = all_df.mean(axis = 1)

In [ ]:
del[avg_df]

NameError: name 'avg_df' is not defined

In [ ]:
avg_df = pd.DataFrame(columns=['task', '상봉', '석환', '성범', '유진','재훈', '정수', '윤찬영', '정찬영', 'avg'])

In [ ]:
i = 0
for index, row in all_df.iterrows():
    tmp_row = []
    tmp_row.append(TASK[i])
    avg_task = 0
    for column in all_df.columns:
        if column == 'total':
            continue
        tmp_row.append(row[column]/row['total'])
        avg_task += (row[column]/row['total'])
    avg_task = avg_task / (len(tmp_row)-1)
    tmp_row.append(avg_task)
    i+=1
    avg_df.loc[len(avg_df)] = tmp_row

In [ ]:
avg_df = avg_df.set_index(keys='task')

In [ ]:
avg_df

,상봉,석환,성범,유진,재훈,정수,윤찬영,정찬영,avg
task,,,,,,,,,
1back,0.010000,0.000000,0.00500,0.005000,0.005000,0.010000,0.000000,0.005000,0.005000
3back,0.080808,0.075758,0.09596,0.106061,0.035354,0.035354,0.106061,0.070707,0.075758
10,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
20,0.000000,0.000000,0.01005,0.005025,0.000000,0.000000,0.000000,0.000000,0.001884

In [ ]:
filename = 'C:/Users/VISLAB-seongwon/workspace/eeg_data.xlsx'

with pd.ExcelWriter(filename) as writer:
    all_df.to_excel(writer, sheet_name='num_of_wrong')
    avg_df.to_excel(writer, sheet_name='wrong_rate')